07_url_shortener/URLShortener/app/models/shortened_url.rb

SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "HItNIsJO7qXEy28F_UVkLw"], ["LIMIT", 1]]
---
	def self.random_code
		to_try = SecureRandom::urlsafe_base64
		while self.exists?(short_url: to_try) == true

INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["long_url", "http://www.facebook.com"], ["short_url", "CRhsWdWkvqPQLyUy950KiQ"], ["user_id", 1]]
INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["long_url", "http://bing.com"], ["short_url", "HItNIsJO7qXEy28F_UVkLw"], ["user_id", 2]]
---
	def self.create_shortened_url(user, long_url)
		raise ArgumentError.new "#{user} is not a User object" if user.is_a?(User) == false
		raise ArgumentError.new "#{long_url} is not a string" if long_url.is_a?(String) == false
		short_url = ShortenedUrl.random_code
		ShortenedUrl.create!(user_id: user.id, long_url: long_url, short_url: short_url)