07_url_shortener/URLShortener/app/models/shortened_url.rb

	def http_prefix
		if self.long_url.include?("http://") == false && self.long_url.include?("https://") == false
---
SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."long_url" = $1 LIMIT $2  [["long_url", "http://bing.com"], ["LIMIT", 1]]