07_url_shortener/URLShortener/app/models/visit.rb

	def self.record_visit!(user, shortened_url)
		raise ArgumentError.new "#{user} is not a User object" unless user.is_a?(User)
		raise ArgumentError.new "#{shortened_url} is not a ShortenedUrl object" unless shortened_url.is_a?(ShortenedUrl)
		Visit.create!(user_id: user.id, shortened_url_id: shortened_url.id)
---
INSERT INTO "visits" ("created_at", "updated_at", "user_id", "shortened_url_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2019-01-07 04:38:18.968089"], ["updated_at", "2019-01-07 04:38:18.968089"], ["user_id", 1], ["shortened_url_id", 2]]